Repository: neko-jpg/MinQ
Catalog: lib/l10n/app_*.arb
Languages: ar, ja

source: Select Language
ja: 言語を選択

# rtlSupport
source: Right-to-Left Language Support
ja: 右から左への言語サポート

source: Text Direction
ja: テキスト方向

source: Layout Direction
ja: レイアウト方向

source: Accessibility Settings
ja: アクセシビリティ設定

source: High Contrast
ja: 高コントラスト

source: Large Text
ja: 大きなテキスト

source: Screen Reader
ja: スクリーンリーダー

source: Theme Settings
ja: テーマ設定

source: Light Mode
ja: ライトモード

source: Dark Mode
ja: ダークモード

# systemDefault
source: Follow System
ja: システム設定に従う

source: Auto Switch Theme
ja: 自動テーマ切り替え

source: Quest Reminders
ja: クエストリマインダー

source: Pair Updates
ja: ペア更新

source: Weekly Reports
ja: 週次レポート

source: Data Management
ja: データ管理

source: Import Data
ja: データインポート

source: Backup Data
ja: データバックアップ

source: Restore Data
ja: データ復元

source: Clear Cache
ja: キャッシュクリア

source: Delete All Data
ja: 全データ削除

source: Privacy Settings
ar: إعدادات الخصوصية
ja: プライバシー設定

source: Data Sharing
ja: データ共有

# analytics
source: Analytics Data
ja: 分析データ

source: Crash Reports
ja: クラッシュレポート

source: Personalized Ads
ja: パーソナライズ広告

source: About App
ja: アプリについて

source: Version
ja: バージョン

source: Build Number
ja: ビルド番号

source: Licenses
ja: ライセンス

source: Open Source Licenses
ja: オープンソースライセンス

source: Contact Support
ja: サポートに連絡

source: Report Bug
ja: バグ報告

source: Feature Request
ja: 機能リクエスト

source: Developer Options
ja: 開発者オプション

source: Debug Mode
ja: デバッグモード

source: Show Performance Overlay
ja: パフォーマンスオーバーレイ表示

source: Enable Logging
ja: ログ有効化

source: Clear Logs
ja: ログクリア

source: Export Logs
ja: ログエクスポート

# streakDayCount
source: {count, plural, =0 {0 day streak} other {{count} day streak}}
ar: {count, plural, =0 {0 أيام متتالية} other {{count} يوم متتالي}}
ja: {count, plural, =0 {連続0日} other {連続{count}日}}

# shareFailed
source: Failed to share progress. Please try again.
ja: 進捗のシェアに失敗しました。もう一度お試しください。

source: Execute Prevention
ar: تنفيذ الوقاية
ja: 対策を実行

source: Execute Now
ar: تنفيذ الآن
ja: 今すぐ実行

source: Show prevention plan
ar: إظهار خطة الوقاية
ja: 対策プランを表示します

# navigateToHabitExecution
source: Navigate to habit execution screen
ar: الانتقال إلى شاشة تنفيذ العادة
ja: 習慣実行画面に移動します

# editHabitScreen
source: Navigate to habit edit screen
ar: الانتقال إلى شاشة تحرير العادة
ja: 習慣編集画面に移動します

source: Add new habit
ar: إضافة عادة جديدة
ja: 新しい習慣を追加します

# executeHabitToday
source: Execute today's habit
ar: تنفيذ عادة اليوم
ja: 今日の習慣を実行しましょう

source: Create mini habit
ar: إنشاء عادة صغيرة
ja: ミニ習慣を作成します

# navigateToChallenges
source: Navigate to challenges screen
ar: الانتقال إلى شاشة التحديات
ja: チャレンジ画面に移動します

source: Detailed Analysis
ar: تحليل مفصل
ja: 詳細分析

source: Improvement Suggestion
ar: اقتراح التحسين
ja: 改善提案

source: AI Improvement Suggestion
ja: AI改善提案

source: View Details
ar: عرض التفاصيل
ja: 詳細を見る

source: Level Details
ar: تفاصيل المستوى
ja: レベル詳細

# levelDetailsMessage
source: Current Level: {level} Progress: {progress}%
ar: المستوى الحالي: {level} التقدم: {progress}%
ja: 現在レベル: {level} 進捗: {progress}%

source: Show Activity
ar: إظهار النشاط
ja: アクティビティを表示

# showActivitySubtitle
source: Display your activity to other users
ar: عرض نشاطك للمستخدمين الآخرين
ja: 他のユーザーにあなたの活動を表示します

source: Allow Interaction
ar: السماح بالتفاعل
ja: 交流を許可

# allowInteractionSubtitle
source: Receive encouragement from other users
ar: تلقي التشجيع من المستخدمين الآخرين
ja: 他のユーザーからの励ましを受け取ります

source: Haptic Feedback
ar: ردود الفعل اللمسية
ja: ハプティックフィードバック

# hapticFeedbackSubtitle
source: Vibrate during activities
ar: الاهتزاز أثناء الأنشطة
ja: アクティビティ時に振動でお知らせします

source: Celebration Effects
ar: تأثيرات الاحتفال
ja: 祝福エフェクト

# celebrationEffectsSubtitle
source: Show celebration effects when completing
ar: إظهار تأثيرات الاحتفال عند الإكمال
ja: 完了時に祝福エフェクトを表示します

# friendInvitationTitle
source: Friend Invitation
ja: 友達招待

# invitedFriends
source: {count} friends invited • {rate}% success rate
ja: {count}人招待済み・成功率{rate}%

# inviteFriendsBonus
source: Invite friends and get bonus points!
ja: 友達を招待してボーナスポイントをゲット！

# specialCampaignTitle
source: Special Campaign
ja: 特別キャンペーン

# inviteFriendsPoints
source: Invite friends and both of you can get up to 3500 points!
ja: 友達を招待すると、あなたも友達も 最大3500ポイントがもらえます！

source: Invite Now
ar: ادع الآن
ja: 今すぐ招待

# pairTitle
source: Pair
ar: الشريك
ja: ペア

# pairQuickMessageGreat
source: Great!
ar: رائع!
ja: すばらしい！

# pairQuickMessageKeepGoing
source: Keep going!
ar: استمر هكذا!
ja: その調子で！

# pairQuickMessageFinishStrong
source: Finish strong!
ar: أكمل بقوة!
ja: 最後まで頑張って！

# pairQuickMessageCompletedGoal
source: Completed the goal!
ar: حققت الهدف!
ja: 目標を達成したよ！

# pairAnonymousPartner
source: Anonymous Partner
ar: شريك مجهول
ja: 匿名のパートナー

# pairPairedQuest
source: Paired in {questName} quest
ar: مقترن في مهمة {questName}
ja: {questName}のクエストでペアリング中

# pairHighFiveAction
source: Send High Five
ar: إرسال تحية
ja: ハイタッチを送る

# pairHighFiveSent
source: High Five Sent
ar: تم إرسال التحية
ja: ハイタッチを送信済み

# pairQuickMessagePrompt
source: Send a quick message
ar: إرسال رسالة سريعة
ja: ひとことメッセージを送る

# pairPartnerHeroTitle
source: Grow together with a partner
ar: انمُ مع شريك!
ja: パートナーと一緒に成長しよう

# pairPartnerHeroDescription
source: Having an accountability partner improves achievement rate by 95%. Continue safely and anonymously.
ar: وجود شريك مساءلة يحسن معدل الإنجاز بنسبة 95%. استمر بأمان مع الهوية المجهولة.
ja: アカウンタビリティパートナーがいると達成率が95%向上します。匿名で安心して続けましょう。

# pairInviteTitle
source: Do you have an invitation code?
ar: هل لديك رمز دعوة؟
ja: 招待コードをお持ちですか？

# pairInviteHint
source: Enter code
ar: أدخل الرمز
ja: コードを入力してください

# pairInviteApply
source: Apply
ar: تطبيق
ja: 適用する

# pairDividerOr
source: Or
ar: أو
ja: または

# pairRandomMatchTitle
source: Random matching
ar: مطابقة عشوائية
ja: ランダムでマッチングする

# pairAgeRangeLabel
source: Age range
ar: الفئة العمرية
ja: 年齢帯

# pairGoalCategoryLabel
source: Goal category
ar: فئة الهدف
ja: 目標カテゴリ

# pairRandomMatchNote
source: Anonymity is protected. Only age range and goal category are shared, and all interactions take place within the app.
ar: يتم الحفاظ على إخفاء الهوية. يتم مشاركة الفئة العمرية وفئة الهدف فقط، وجميع التفاعلات تتم داخل التطبيق.
ja: 匿名性は守られます。年齢帯と目標カテゴリのみが共有され、すべてのやり取りはアプリ内で行われます。

# pairAgeOption1824
source: 18-24 years
ar: 18-24 سنة
ja: 18-24歳

# pairAgeOption2534
source: 25-34 years
ar: 25-34 سنة
ja: 25-34歳

# pairAgeOption3544
source: 35-44 years
ar: 35-44 سنة
ja: 35-44歳

# pairAgeOption45Plus
source: 45+ years
ar: 45 سنة فأكثر
ja: 45歳以上

# pairGoalFitness
source: Fitness
ar: اللياقة البدنية
ja: フィットネス

# pairGoalLearning
source: Learning
ar: التعلم
ja: 学習

# pairGoalWellbeing
source: Well-being
ar: الرفاهية
ja: ウェルビーイング

# pairGoalProductivity
source: Productivity
ar: الإنتاجية
ja: 生産性

source: Voice Test
ar: اختبار الصوت
ja: 音声テスト

# voiceTestSubtitle
source: Test voice coaching
ar: اختبار التدريب الصوتي
ja: 音声コーチングをテストします

source: Message Test
ja: メッセージテスト

# messageTestSubtitle
source: Test coaching messages
ja: コーチングメッセージをテストします

# intervalMinutes
source: {minutes} min interval
ja: {minutes}分間隔

# minutesShort
source: {minutes} min
ja: {minutes}分

source: Progress
ja: 進捗

# searchHint
source: Search...
ja: 検索...

source: Search quests
ja: クエストを検索

source: Filter by tags
ja: タグでフィルター

source: Clear filters
ar: مسح المرشحات
ja: フィルターをクリア

source: Filters
ja: フィルター

source: Category
ja: カテゴリ

source: Difficulty
ja: 難易度

source: Location
ja: 場所

source: Status
ja: ステータス

source: All
ja: すべて

source: Sort by
ja: 並び順

# sortByRelevance
source: Relevance
ja: 関連度

# sortByDateCreated
source: Date created
ja: 作成日

# sortByDateUpdated
source: Date updated
ja: 更新日

# sortByAlphabetical
source: Alphabetical
ja: アルファベット順

source: Search results
ja: 検索結果

source: Search history
ja: 検索履歴

source: Saved searches
ja: 保存された検索

source: Advanced search
ja: 高度な検索

source: History
ja: 履歴

# searchResultsCount
source: {count} results
ja: {count}件の結果

# matchedKeywords
source: Matched keywords: {keywords}
ja: マッチしたキーワード: {keywords}

# searchError
source: Search error occurred
ja: 検索エラーが発生しました

source: Today
ja: 今日

source: Yesterday
ja: 昨日

# daysAgo
source: {days} days ago
ja: {days}日前

# exportNotImplemented
source: Export feature not implemented
ja: エクスポート機能は未実装です

source: Voice search not implemented
ja: 音声検索は未実装です

source: Filter only
ja: フィルターのみ

# resultsCount
source: {count} results
ja: {count}件の結果

source: Just now
ja: たった今

# minutesAgo
source: {minutes} minutes ago
ja: {minutes}分前

# hoursAgo
source: {hours} hours ago
ja: {hours}時間前

source: No search history
ja: 検索履歴がありません

# noSearchHistoryDescription
source: Search history will appear here when you perform searches
ja: 検索を実行すると、ここに履歴が表示されます

source: No saved searches
ja: 保存された検索がありません

# noSavedSearchesDescription
source: Save frequently used search conditions for quick access
ja: よく使う検索条件を保存して、素早くアクセスできます

source: Save search
ja: 検索を保存

# usedCount
source: Used {count} times
ja: {count}回使用

source: Clear search history
ja: 検索履歴をクリア

# clearSearchHistoryConfirmation
source: Delete all search history? This action cannot be undone.
ja: 検索履歴をすべて削除しますか？この操作は取り消せません。

source: Clear
ja: クリア

source: History entry removed
ja: 履歴エントリを削除しました

# saveSearchNotImplemented
source: Save search feature not implemented
ja: 検索保存機能は未実装です

# editNotImplemented
source: Edit feature not implemented
ja: 編集機能は未実装です

source: Delete saved search
ja: 保存された検索を削除

# deleteSavedSearchConfirmation
source: Delete "{name}"?
ja: 「{name}」を削除しますか？

source: Search saved
ja: 検索を保存しました

source: Popular keywords
ja: 人気のキーワード

source: Recent searches
ja: 最近の検索

source: View all
ja: すべて表示

source: Search tips
ja: 検索のヒント

# searchTipKeywords
source: Keyword search
ja: キーワード検索

# searchTipKeywordsDescription
source: Search by title, description, and tags
ja: タイトル、説明、タグから検索できます

# searchTipFilters
source: Filter features
ja: フィルター機能

# searchTipFiltersDescription
source: Filter by category, difficulty, location, etc.
ja: カテゴリ、難易度、場所などで絞り込めます

# searchTipSave
source: Save searches
ja: 検索を保存

# searchTipSaveDescription
source: Save frequently used search conditions for quick access
ja: よく使う検索条件を保存して素早くアクセス

source: Search settings not implemented
ja: 検索設定は未実装です

source: Search help
ja: 検索ヘルプ

# searchHelpContent
source: Learn how to use the search features.
ja: 検索機能の使い方について説明します。

source: Search name
ja: 検索名

# searchNameHint
source: e.g., Exercise quests
ja: 例: 運動系クエスト

source: Clear all
ja: すべてクリア

source: Load error
ja: 読み込みエラー

source: Animation Settings
ja: アニメーション設定

# animationSettingsTitle
source: Animation Settings
ja: アニメーション設定

# animationSettingsDescription
source: Customize animation behavior and accessibility options
ja: アニメーションの動作とアクセシビリティオプションをカスタマイズします

source: Enable Animations
ja: アニメーションを有効にする

# enableAnimationsDescription
source: Turn on/off all animations in the app
ja: アプリ内のすべてのアニメーションをオン/オフします

source: Reduced Motion
ja: モーション軽減

# reducedMotionDescription
source: Minimize motion for accessibility
ja: アクセシビリティのためにモーションを最小限に抑えます

source: Feedback Settings
ja: フィードバック設定

# feedbackSettingsDescription
source: Configure haptic and sound feedback
ja: ハプティックとサウンドフィードバックを設定します

# hapticFeedbackDescription
source: Enable vibration feedback for interactions
ja: 操作時の振動フィードバックを有効にします

source: Sound Effects
ja: サウンドエフェクト

# soundEffectsDescription
source: Enable sound effects for actions
ja: アクション時のサウンドエフェクトを有効にします

source: Animation Preview
ja: アニメーションプレビュー

# animationPreviewDescription
source: Test different animation types
ja: さまざまなアニメーションタイプをテストします

source: Test Animations
ja: アニメーションテスト

# testFadeIn
source: Fade In
ja: フェードイン

# testSlideIn
source: Slide In
ja: スライドイン

# testScale
source: Scale
ja: スケール

# testHaptic
source: Haptic
ja: ハプティック

source: Accessibility Note
ja: アクセシビリティについて

# accessibilityNoteDescription
source: These settings help users with motion sensitivity or other accessibility needs. Reduced motion will disable most animations while keeping essential feedback.
ja: これらの設定は、モーション感受性やその他のアクセシビリティニーズを持つユーザーを支援します。モーション軽減は、重要なフィードバックを保持しながら、ほとんどのアニメーションを無効にします。

source: Estimated Time
ja: 推定時間

# difficultyEasy
source: Easy
ja: 簡単

# difficultyMedium
source: Medium
ja: 普通

# difficultyHard
source: Hard
ja: 難しい

# duration5min
source: 5 minutes
ja: 5分

# duration10min
source: 10 minutes
ja: 10分

# duration15min
source: 15 minutes
ja: 15分

# duration30min
source: 30 minutes
ja: 30分

# duration1hour
source: 1 hour
ja: 1時間

# locationHome
source: Home
ja: 自宅

# locationGym
source: Gym
ja: ジム

# locationOffice
source: Office
ja: オフィス

# locationOutdoor
source: Outdoor
ja: 屋外

# locationLibrary
source: Library
ja: 図書館

source: Completed
ar: مكتمل!
ja: 完了

source: Paused
ar: متوقف مؤقتاً
ja: 一時停止

source: Running
ja: 実行中

source: Ready
ja: 準備完了

source: Timer Completed
ar: انتهى المؤقت!
ja: タイマー完了

source: Work Session
ja: 作業セッション

source: Break Time
ja: 休憩時間

source: Required
ja: 必須

# pleaseEnterAnswer
source: Please enter an answer
ar: يرجى إدخال إجابتك
ja: 回答を入力してください

source: User Satisfaction Survey
ar: استطلاع رضا المستخدمين
ja: ユーザー満足度調査

# userSatisfactionDescription
source: Help us improve MinQ
ar: ساعدنا في تحسين MinQ من خلال مشاركة ملاحظاتك
ja: MinQの改善にご協力ください

source: Usability Rating
ja: 使いやすさの評価

source: Most Liked Feature
ar: ما هي الميزة التي تعجبك أكثر؟
ja: 最も気に入った機能

source: Quest Management
ar: إدارة المهام
ja: クエスト管理

source: Pair Feature
ar: ميزة الشريك
ja: ペア機能

source: Statistics Graphs
ar: الإحصائيات والرسوم البيانية
ja: 統計グラフ

source: Notification Feature
ar: ميزة الإشعارات
ja: 通知機能

source: Other
ar: أخرى
ja: その他

# wouldRecommendMinq
source: Would you recommend MinQ to friends?
ar: هل تنصح الأصدقاء بـ MinQ؟
ja: MinQを友人に勧めますか？

source: Improvement Suggestions
ar: أي اقتراحات للتحسين؟
ja: 改善提案

source: Weekly Achievement Heatmap
ar: خريطة الإنجازات الأسبوعية
ja: 週間達成ヒートマップ

source: New version available
ar: إصدار جديد متاح
ja: 新しいバージョンが利用可能です

# priorityHigh
source: High
ja: 高

# priorityMedium
source: Medium
ja: 中

# priorityLow
source: Low
ja: 低

# newVersionMessage
source: Version {version} is available. Please update for the best experience.
ar: إصدار جديد ({version}) متاح. ننصح بالتحديث للحصول على تجربة أفضل.
ja: バージョン{version}が利用可能です。最高の体験のためにアップデートしてください。

source: Streak Tracking
ja: 連続記録追跡

source: Weekly Stats
ja: 週間統計

source: Advanced Stats
ja: 高度な統計

source: Data Export
ja: データエクスポート

source: Tags
ja: タグ

source: Achievements
ja: 実績

source: Events
ja: イベント

source: Templates
ja: テンプレート

source: Timer
ja: タイマー

source: Advanced Customization
ja: 高度なカスタマイズ

source: Open Settings
ja: 設定を開く

source: Thank you!
ar: شكراً لك

# celebrationNewLongestStreak
source: New Longest Streak!
ar: تم تحديث الرقم القياسي المتتالي!

# celebrationStreakMessage
source: {streak} day streak!
ar: {count, plural, =0 {لا يوجد رقم قياسي بعد. لنبدأ اليوم!} other {تحقيق {count} يوم متتالي!}}

# celebrationLongestSubtitle
source: You've reached a new personal best!
ar: تم تحديث أفضل رقم شخصي!

# celebrationKeepGoingSubtitle
source: Keep up the great work!
ar: تسير الأمور بشكل جيد جداً. استمر هكذا.

# celebrationRewardTitle
source: Reward Unlocked
ar: مكافأة

# celebrationRewardName
source: Streak Master
ar: تمرين تنفس لمدة دقيقة واحدة

# celebrationRewardDescription
source: Earned for maintaining a consistent habit streak
ar: هدئ عقلك بالتنفس العميق

# celebrationDone
source: Continue
ar: إكمال
