Repository: neko-jpg/MinQ
Catalog: lib/l10n/app_*.arb
Languages: ar, ja

source: Good Morning!
ar: صباح الخير!
ja: おはようございます！

source: Today's Quests
ar: مهام اليوم
ja: 今日のQuest

source: Today's 3 recommendations
ar: 3 توصيات لليوم
ja: 今日のおすすめ3件

# swapOrSnooze
source: Swap or snooze can be changed with one tap.
ar: يمكن تغيير التبديل أو الغفوة بنقرة واحدة.
ja: スワップまたはスヌーズはワンタップで変更できます。

# replacedRecommendation
source: Replaced the recommendation.
ar: تم استبدال التوصية.
ja: おすすめを入れ替えました。

# snoozedRecommendation
source: Snoozed this recommendation until tomorrow.
ar: تم تأجيل هذه التوصية حتى الغد.
ja: このおすすめを明日までスヌーズしました。

# noQuestsToday
source: No Quests for today yet
ar: لا توجد مهام لليوم بعد
ja: 今日のQuestはまだありません

# chooseFromTemplate
source: Choose from a template and start your 3-tap habit.
ar: اختر من القالب وابدأ عادتك بـ 3 نقرات.
ja: テンプレートから選んで、3タップ習慣を始めましょう。

source: Find a Quest
ar: البحث عن مهمة
ja: クエストを探す

# swapRecommendation
source: Swap to another recommendation
ar: استبدال بتوصية أخرى
ja: 別のおすすめに入れ替える

source: Snooze until tomorrow
ar: تأجيل حتى الغد
ja: 明日までスヌーズする

source: Snoozed
ar: مؤجل
ja: スヌーズ済み

source: Undo
ar: تراجع
ja: 元に戻す

# dismissHelpBanner
source: Dismiss tips
ar: إغلاق النصائح
ja: ヒントを閉じる

source: Open profile
ar: فتح الملف الشخصي
ja: プロフィールを開く

# snoozeTemporarilyDisabled
source: Snooze is temporarily disabled
ar: التأجيل معطل مؤقتاً
ja: スヌーズは一時的に無効です

# settingsTitle
source: Settings
ar: الإعدادات
ja: 設定

# settingsSectionGeneral
source: General
ar: عام
ja: 一般設定

# settingsPushNotifications
source: Push Notifications
ar: الإشعارات الفورية
ja: プッシュ通知

# settingsPushNotificationsSubtitle
source: Reminders and partner updates
ar: التذكيرات وتحديثات الشريك
ja: リマインダーとパートナーの更新

# settingsNotificationTime
source: Notification Time
ar: وقت الإشعار
ja: 通知時間

# settingsSound
source: Sound
ar: الصوت
ja: サウンド

# settingsProfile
source: Profile Settings
ar: إعدادات الملف الشخصي
ja: プロフィール設定

# settingsSectionPrivacy
source: Privacy and Data
ar: الخصوصية والبيانات
ja: プライバシーとデータ

# settingsDataSync
source: Data Sync
ar: إعداد مزامنة البيانات
ja: データ同期

# settingsDataSyncSubtitle
source: Cloud sync settings
ar: مزامنة البيانات عبر الأجهزة
ja: クラウド同期の設定

# settingsManageBlockedUsers
source: Manage Blocked Users
ar: إدارة المستخدمين المحظورين
ja: ブロック中のユーザーを管理する

# settingsExportData
source: Export Data
ar: تصدير البيانات
ja: データをエクスポートする

# settingsDeleteAccount
source: Delete Account
ar: حذف الحساب والبيانات
ja: アカウント削除

# settingsSectionAbout
source: About MinQ
ar: حول MinQ
ja: MinQについて

# settingsTermsOfService
source: Terms of Service
ar: شروط الخدمة
ja: 利用規約

# settingsPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية
ja: プライバシーポリシー

# settingsAppVersion
source: App Version
ar: إصدار التطبيق
ja: アプリバージョン

# settingsSectionDeveloper
source: Developer Options
ar: خيارات المطور
ja: 開発者向けオプション

# settingsUseDummyData
source: Use Dummy Data
ar: استخدام بيانات وهمية
ja: ダミーデータを使用する

# settingsUseDummyDataSubtitle
source: Use dummy data instead of the database.
ar: استخدام بيانات وهمية بدلاً من قاعدة البيانات.
ja: データベースの代わりにダミーデータを使用します。

# settingsSocialSharingDemo
source: Try Social Sharing Demo
ar: تجربة المشاركة الاجتماعية
ja: ソーシャル共有デモを試す

# settingsSocialSharingDemoSubtitle
source: Test social sharing and celebration features
ar: اختبار المشاركة الاجتماعية وميزات الاحتفال
ja: ソーシャル共有と祝福機能をテストします

# questsTitle
source: Mini-Quests
ar: المهام الصغيرة
ja: ミニクエスト

# questsSearchHint
source: Search for templates...
ar: البحث عن القوالب...
ja: テンプレートを検索...

# questsFabLabel
source: Create Custom
ar: إنشاء مخصص
ja: カスタムを作成する

# questsCategoryFeatured
source: Featured
ar: مميز
ja: おすすめ

# questsCategoryMyQuests
source: My Quests
ar: مهامي
ja: 自分のクエスト

# questsCategoryAll
source: All
ar: الكل
ja: すべて

source: Notification Settings
ar: إعدادات الإشعارات
ja: 通知設定

source: Notification Analytics
ja: 通知分析

# errorLoadingSettings
source: Failed to load settings
ja: 設定の読み込みに失敗しました

source: Retry
ar: إعادة المحاولة
ja: 再試行

source: Global Settings
ja: 全体設定

source: Enable Notifications
ja: 通知を有効にする

# enableNotificationsDescription
source: Enable or disable all notifications at once
ja: すべての通知を一括で有効/無効にします

source: Category Settings
ja: カテゴリ別設定

# categorySettingsDescription
source: Fine-tune settings for each type of notification
ja: 通知の種類ごとに細かく設定できます

source: Time Settings
ja: 時間帯設定

# timeSettingsDescription
source: Control when you receive notifications
ja: 通知を受け取る時間帯を制御します

# smartSettings
source: Smart Notifications
ja: スマート通知

# smartSettingsDescription
source: AI learns your behavior patterns for optimization
ja: AIがあなたの行動パターンを学習して最適化します

source: Analytics Settings
ja: 分析設定

# analyticsSettingsDescription
source: Notification effectiveness measurement and privacy settings
ja: 通知の効果測定とプライバシー設定

source: Reset to Defaults
ja: デフォルトに戻す

source: Test Notification
ja: テスト通知

source: Reset Settings
ja: 設定をリセット

# resetSettingsConfirmation
source: Reset all notification settings to defaults?
ja: すべての通知設定をデフォルトに戻しますか？

source: Cancel
ar: إلغاء
ja: キャンセル

source: Reset
ar: إعادة تعيين
ja: リセット

# settingsReset
source: Settings have been reset
ja: 設定をリセットしました

# testNotificationTitle
source: Test Notification
ja: テスト通知

# testNotificationBody
source: Notification settings are working properly
ja: 通知設定が正常に動作しています

source: Test notification sent
ja: テスト通知を送信しました

source: Quest Notifications
ja: クエスト通知

source: Challenge Notifications
ja: チャレンジ通知

source: Pair Notifications
ja: ペア通知

source: League Notifications
ja: リーグ通知

# aiNotifications
source: AI Coach Notifications
ja: AIコーチ通知

source: System Notifications
ja: システム通知

source: Achievement Notifications
ja: 実績通知

source: Reminder Notifications
ja: リマインダー通知

source: Enabled
ja: 有効

source: Disabled
ja: 無効

source: Notification Frequency
ja: 通知頻度

source: Notification Options
ja: 通知オプション

source: Sound
ja: 音

# soundDescription
source: Play notification sound
ja: 通知音を再生します

source: Vibration
ja: 振動

# vibrationDescription
source: Vibrate the device
ja: デバイスを振動させます

source: Badge
ja: バッジ

# badgeDescription
source: Show badge on app icon
ja: アプリアイコンにバッジを表示します

source: Lock Screen
ja: ロック画面

# lockScreenDescription
source: Show notifications on lock screen
ja: ロック画面に通知を表示します

source: Immediate
ja: 即座

# hourly
source: 1 Hour Later
ja: 1時間後

# threeHours
source: 3 Hours Later
ja: 3時間後

# daily
source: Next Day
ja: 翌日

source: Enable Time-Based Control
ja: 時間帯制御を有効にする

# enableTimeBasedControlDescription
source: Control notifications during specified time periods
ja: 指定した時間帯の通知を制御します

source: Sleep Time
ja: 就寝時間

source: Sleep Time Range
ja: 就寝時間帯

source: Work Time
ja: 勤務時間

source: Work Time Range
ja: 勤務時間帯

# respectSystemDnd
source: Respect System DND Mode
ja: システムのDNDモードを尊重

# respectSystemDndDescription
source: Follow device's Do Not Disturb settings
ja: デバイスのおやすみモード設定に従います

source: Weekend Mode
ja: 週末モード

# weekendModeDescription
source: Use different time settings for weekends
ja: 週末は異なる時間設定を使用します

source: Weekend Sleep Time
ja: 週末の就寝時間

source: Weekend Sleep Time Range
ja: 週末の就寝時間帯

source: Weekend Work Time
ja: 週末の勤務時間

source: Weekend Work Time Range
ja: 週末の勤務時間帯

source: Start Time
ja: 開始時刻

source: End Time
ja: 終了時刻

source: Enable Smart Notifications
ja: スマート通知を有効にする

# enableSmartNotificationsDescription
source: AI learns your behavior patterns to optimize notifications
ja: AIがあなたの行動パターンを学習して通知を最適化します

# behaviorLearning
source: Behavior Pattern Learning
ja: 行動パターン学習

# behaviorLearningDescription
source: Learn from your notification responses
ja: あなたの通知への反応を学習します

# adaptiveFrequency
source: Adaptive Frequency Adjustment
ja: 適応的頻度調整

# adaptiveFrequencyDescription
source: Adjust notification frequency based on engagement
ja: エンゲージメントに基づいて通知頻度を調整します

# contextAware
source: Context Awareness
ja: コンテキスト認識

# contextAwareDescription
source: Consider current situation for notification timing
ja: 現在の状況を考慮して通知タイミングを決定します

source: Engagement Optimization
ja: エンゲージメント最適化

# engagementOptimizationDescription
source: Find the most effective notification methods
ja: 最も効果的な通知方法を見つけます

source: Confidence Threshold
ja: 信頼度閾値

# confidenceThresholdDescription
source: Apply optimization only when AI prediction confidence is above this value
ja: AI予測の信頼度がこの値以上の場合のみ最適化を適用します

source: Learning Period
ja: 学習期間

# learningPeriodDescription
source: Use data from this period to learn patterns
ja: この期間のデータを使用してパターンを学習します

# daysCount
source: {count} days
ja: {count}日

source: View Learning Data
ja: 学習データを表示

source: Reset Learning
ja: 学習をリセット

# learningDataTitle
source: Learning Data
ja: 学習データ

# learningDataDescription
source: Your notification patterns learned by AI
ja: AIが学習したあなたの通知パターンです

source: Total Notifications Sent
ja: 送信された通知数

source: Total Notifications Opened
ja: 開封された通知数

source: Average Open Rate
ja: 平均開封率

source: Optimal Time Slots
ja: 最適な時間帯

source: Close
ar: إغلاق
ja: 閉じる

source: Reset Learning Data
ja: 学習データをリセット

# resetLearningDataConfirmation
source: Resetting learning data will make AI start learning again. Are you sure?
ja: 学習データをリセットすると、AIが再び学習を開始します。よろしいですか？

# learningDataReset
source: Learning data has been reset
ja: 学習データをリセットしました

source: Enable Analytics
ja: 分析を有効にする

# enableAnalyticsDescription
source: Measure notification effectiveness for improvement
ja: 通知の効果を測定して改善に役立てます

source: Tracking Options
ja: 追跡オプション

source: Track Open Rate
ja: 開封率を追跡

# trackOpenRateDescription
source: Measure how often notifications are opened
ja: 通知がどれくらい開封されているかを測定します

source: Track Engagement Rate
ja: エンゲージメント率を追跡

# trackEngagementRateDescription
source: Measure action execution rate from notifications
ja: 通知からのアクション実行率を測定します

source: Track Conversion Rate
ja: コンバージョン率を追跡

# trackConversionRateDescription
source: Measure conversion rate from notifications to goal achievement
ja: 通知から目標達成への転換率を測定します

# trackOptimalTiming
source: Analyze Optimal Timing
ja: 最適タイミングを分析

# trackOptimalTimingDescription
source: Analyze the most effective notification timing
ja: 最も効果的な通知タイミングを分析します

source: Data Retention Period
ja: データ保持期間

# dataRetentionDescription
source: Analytics data older than this period will be automatically deleted
ja: この期間を過ぎた分析データは自動的に削除されます

# analyticsPrivacyNote
source: Analytics data is stored only on your device and never sent externally
ja: 分析データはデバイス内にのみ保存され、外部に送信されることはありません

source: Export Data
ja: データをエクスポート

source: Delete Data
ja: データを削除

source: Export Analytics Data
ja: 分析データをエクスポート

# exportAnalyticsDataDescription
source: Export notification analytics data as a file
ja: 通知分析データをファイルとしてエクスポートします

source: Export Format
ja: エクスポート形式

source: CSV Format
ja: CSV形式

# csvFormatDescription
source: Can be opened with spreadsheet software
ja: 表計算ソフトで開けます

source: JSON Format
ja: JSON形式

# jsonFormatDescription
source: Easy to process programmatically
ja: プログラムで処理しやすい形式です

source: Export
ja: エクスポート

# dataExported
source: Data has been exported
ja: データをエクスポートしました

source: Delete Analytics Data
ja: 分析データを削除

# deleteAnalyticsDataConfirmation
source: Delete all analytics data? This action cannot be undone.
ja: すべての分析データを削除しますか？この操作は取り消せません。

source: Delete
ja: 削除

# analyticsDataDeleted
source: Analytics data has been deleted
ja: 分析データを削除しました

# hintFirstQuest
source: Let's create your first quest!
ja: 最初のクエストを作成しましょう！

# hintFirstQuestMessage
source: Create a quest and take the first step towards building habits. Starting with small goals is the key to success.
ja: クエストを作成して習慣化の第一歩を踏み出しましょう。 小さな目標から始めることが成功の秘訣です。

# hintFirstCompletion
source: First completion! Continuing will increase your streak.
ja: 初めての完了！継続することでストリークが増えます。

# hintFirstCompletionMessage
source: Continuing will increase your streak. It's important to keep going even a little bit every day.
ja: 継続することでストリークが増えます。 毎日少しずつでも続けることが大切です。

# hintStreak
source: Amazing streak!
ja: 素晴らしいストリーク！

# hintStreakMessage
source: {streakDays} days in a row! Keep up your habits and aim for even greater growth.
ja: {streakDays}日連続達成です！ 引き続き習慣を続けて、さらなる成長を目指しましょう。

# hintWeeklyGoal
source: Weekly goal achieved!
ja: 週次目標達成！

# hintWeeklyGoalMessage
source: You've achieved this week's goal! You can check detailed progress on the stats screen.
ja: 今週の目標を達成しました！ 統計画面で詳細な進捗を確認できます。

# hintPairFeatureUnlock
source: Pair feature unlocked!
ja: ペア機能が解放されました！

# hintPairFeatureUnlockMessage
source: You can now work on habits together with friends. Encourage each other to keep going.
ja: 友達と一緒に習慣化に取り組めます。 お互いに励まし合って継続しましょう。

# hintAdvancedStatsUnlock
source: Advanced statistics unlocked!
ja: 高度な統計が解放されました！

# hintAdvancedStatsUnlockMessage
source: Detailed analysis and insights are now available. Gain a deeper understanding of your habit patterns.
ja: 詳細な分析とインサイトが利用できます。 自分の習慣パターンを深く理解しましょう。

# hintAchievementsUnlock
source: Achievements feature unlocked!
ja: 実績機能が解放されました！

# hintAchievementsUnlockMessage
source: Earn various achievements and feel your growth. Try challenging yourself with new goals.
ja: 様々な実績を獲得して成長を実感しましょう。 新しい目標に挑戦してみてください。

# hintUnderstood
source: Got it
ja: 了解

# hintClose
source: Close
ja: 閉じる

# questsCategoryLearning
source: Learning
ar: التعلم
ja: 学習

# questsCategoryExercise
source: Exercise
ar: التمرين
ja: エクササイズ

# questsCategoryTidying
source: Tidying
ar: الترتيب
ja: 片付け

# questsCategoryRecent
source: Recent
ar: الأخيرة
ja: 最近

# authErrorOperationNotAllowed
source: Anonymous sign-in is not enabled for this project.
ja: 匿名サインインはこのプロジェクトでは有効になっていません。

# authErrorWeakPassword
source: The password provided is too weak.
ja: パスワードが弱すぎます。より強力なパスワードを設定してください。

# authErrorEmailAlreadyInUse
source: An account already exists for that email.
ja: このメールアドレスは既に使用されています。

# authErrorInvalidEmail
source: The email address is not valid.
ja: メールアドレスの形式が正しくありません。

# authErrorUserDisabled
source: This user has been disabled.
ja: このユーザーは無効化されています。

# authErrorUserNotFound
source: No user found for this email.
ja: このメールアドレスのユーザーが見つかりませんでした。

# authErrorWrongPassword
source: Wrong password provided for this user.
ja: パスワードが間違っています。

# authErrorAccountExistsWithDifferentCredential
source: An account already exists with the same email address but different sign-in credentials.
ja: 同じメールアドレスで、異なるログイン方法の既存アカウントがあります。

# authErrorInvalidCredential
source: The credential received is malformed or has expired.
ja: 認証情報が無効か、期限切れです。

# authErrorUnknown
source: An unknown error occurred.
ja: 不明なエラーが発生しました。

source: Back
ar: رجوع
ja: 戻る

source: Yes
ar: نعم
ja: はい

source: No
ar: لا
ja: いいえ

source: Save
ja: 保存する

source: Edit
ja: 編集

source: Create
ja: 作成

source: Update
ja: 更新

source: Next
ar: التالي
ja: 次へ

source: Previous
ja: 前へ

source: Skip
ar: تخطي
ja: スキップ

source: Complete
ar: إكمال
ja: 完了

source: Start
ar: بدء
ja: 開始

# settingsEnhancedTitle
source: Settings
ja: 設定

# settingsSearchHint
source: Search settings...
ja: 設定を検索...

# settingsSearchHistoryTitle
source: Recent searches
ja: 最近の検索

# settingsSearchPopularTitle
source: Popular searches
ja: 人気の検索

# settingsSearchClear
source: Clear
ja: クリア

# settingsSearchNoResults
source: No search results found
ja: 検索結果が見つかりませんでした

# settingsSearchNoResultsSubtitle
source: Try searching with different keywords
ja: 別のキーワードで検索してみてください

# settingsShowAdvanced
source: Show advanced settings
ja: 高度な設定を表示

# settingsHideAdvanced
source: Hide advanced settings
ja: 高度な設定を非表示

# settingsCategoryAppearance
source: Appearance & Theme
ja: 外観・テーマ

# settingsCategoryAppearanceSubtitle
source: Customize app appearance
ja: アプリの見た目をカスタマイズ

# settingsCategoryNotifications
source: Notifications
ja: 通知

# settingsCategoryNotificationsSubtitle
source: Notification settings and management
ja: 通知の設定と管理

# settingsCategoryPrivacy
source: Privacy & Security
ja: プライバシー・セキュリティ

# settingsCategoryPrivacySubtitle
source: Data protection and security settings
ja: データ保護とセキュリティ設定

# settingsCategoryAccessibility
source: Accessibility
ja: アクセシビリティ

# settingsCategoryAccessibilitySubtitle
source: Accessibility settings
ja: 使いやすさの設定

# settingsCategoryData
source: Data Management
ja: データ管理

# settingsCategoryDataSubtitle
source: Data backup and management
ja: データのバックアップと管理

# settingsCategoryAbout
source: About
ja: アプリについて

# settingsCategoryAboutSubtitle
source: Support and information
ja: サポートと情報

# settingsCategoryAdvanced
source: Advanced Settings
ja: 高度な設定

# settingsCategoryAdvancedSubtitle
source: Developer and advanced user settings
ja: 開発者・上級者向け設定

# settingsCategoryAdvancedBadge
source: Advanced
ja: 高度

# settingsThemeMode
source: Theme Mode
ja: テーマモード

# settingsThemeModeSubtitle
source: Light, Dark, or System setting
ja: ライト・ダーク・システム設定

# settingsThemeModeSystem
source: Follow System Setting
ja: システム設定に従う

# settingsThemeModeSystemSubtitle
source: Automatically switch based on device settings
ja: デバイスの設定に合わせて自動切り替え

# settingsThemeModeLight
source: Light Mode
ja: ライトモード

# settingsThemeModeLightSubtitle
source: Use light theme
ja: 明るいテーマを使用

# settingsThemeModeDark
source: Dark Mode
ja: ダークモード

# settingsThemeModeDarkSubtitle
source: Use dark theme
ja: 暗いテーマを使用

# settingsAccentColor
source: Accent Color
ja: アクセントカラー

# settingsAccentColorSubtitle
source: Select app main color
ja: アプリのメインカラーを選択

# settingsThemeCustomization
source: Theme Customization
ja: テーマカスタマイズ

# settingsThemeCustomizationSubtitle
source: Detailed theme settings
ja: 詳細なテーマ設定

# settingsNotificationsEnabled
source: Enable Notifications
ja: 通知を有効にする

# settingsNotificationsEnabledSubtitle
source: Receive push notifications
ja: プッシュ通知の受信

# settingsNotificationTimeSubtitle
source: Daily reminder time
ja: デイリーリマインダーの時間

# settingsNotificationCategories
source: Notification Categories
ja: 通知カテゴリ

# settingsNotificationCategoriesSubtitle
source: Category-specific notification settings
ja: カテゴリ別の通知設定

# settingsSmartNotifications
source: Smart Notifications
ja: スマート通知

# settingsSmartNotificationsSubtitle
source: AI-optimized notification timing
ja: AIによる最適な通知タイミング

# settingsBiometricAuth
source: Biometric Authentication
ja: 生体認証

# settingsBiometricAuthSubtitle
source: Protect app with fingerprint/face recognition
ja: 指紋・顔認証でアプリを保護

# settingsPrivacySettings
source: Privacy Settings
ja: プライバシー設定

# settingsPrivacySettingsSubtitle
source: Data usage and privacy management
ja: データ使用とプライバシー管理

# settingsHighContrast
source: High Contrast
ja: 高コントラスト

# settingsHighContrastSubtitle
source: Enhance color contrast
ja: 色のコントラストを強化

# settingsLargeText
source: Large Text
ja: 大きな文字

# settingsLargeTextSubtitle
source: Increase text size
ja: テキストサイズを拡大

# settingsAnimationsEnabled
source: Animations
ja: アニメーション

# settingsAnimationsEnabledSubtitle
source: Enable/disable animation effects
ja: アニメーション効果の有効/無効

# settingsDataExport
source: Data Export
ja: データエクスポート

# settingsDataExportSubtitle
source: Export data to file
ja: データをファイルに出力

# settingsDataImport
source: Data Import
ja: データインポート

# settingsDataImportSubtitle
source: Restore from backup file
ja: バックアップファイルから復元

# settingsStorageUsage
source: Storage Usage
ja: ストレージ使用量

# settingsStorageUsageSubtitle
source: Check app data usage
ja: アプリのデータ使用量を確認

# settingsHelpCenter
source: Help Center
ja: ヘルプセンター

# settingsHelpCenterSubtitle
source: FAQ and usage guide
ja: よくある質問と使い方

# settingsContactSupport
source: Contact Support
ja: お問い合わせ

# settingsContactSupportSubtitle
source: Bug reports and feature requests
ja: バグ報告や機能要望

# settingsAppVersionSubtitle
source: Version 1.0.0
ja: バージョン 1.0.0

# settingsDeveloperMode
source: Developer Mode
ja: 開発者モード

# settingsDeveloperModeSubtitle
source: Enable developer features
ja: 開発者向け機能を有効化

# settingsDebugMode
source: Debug Mode
ja: デバッグモード

# settingsDebugModeSubtitle
source: Show debug information
ja: デバッグ情報を表示

# settingsResetSettings
source: Reset Settings
ja: 設定をリセット

# settingsResetSettingsSubtitle
source: Reset all settings to default
ja: すべての設定を初期値に戻す

# settingsDeleteAccountSubtitle
source: Permanently delete account and data
ja: アカウントとデータを完全削除

# themeCustomizationTitle
source: Theme Customization
ja: テーマカスタマイズ

# themeCustomizationPreviewShow
source: Show Preview
ja: プレビューを表示

# themeCustomizationPreviewHide
source: Hide Preview
ja: プレビューを非表示

# themeCustomizationThemeModeSection
source: Theme Mode
ja: テーマモード

# themeCustomizationThemeModeSubtitle
source: Select app brightness
ja: アプリの明るさを選択

# themeCustomizationAccentColorSection
source: Accent Color
ja: アクセントカラー

# themeCustomizationAccentColorSubtitle
source: Select app main color
ja: アプリのメインカラーを選択

# themeCustomizationApply
source: Apply Changes
ja: 変更を適用

# themeCustomizationReset
source: Reset to Default
ja: デフォルトに戻す

# themeCustomizationApplied
source: Theme settings applied
ja: テーマ設定を適用しました

# themeCustomizationResetDone
source: Theme settings reset
ja: テーマ設定をリセットしました

# colorPickerTitle
source: Color Selection
ja: カラー選択

# colorPickerPreview
source: Preview
ja: プレビュー

# colorPickerApply
source: Apply
ja: 適用

# timePickerTitle
source: Time Selection
ja: 時間選択

# timePickerChange
source: Change Time
ja: 時間を変更

# timePickerQuickTimes
source: Quick Times
ja: よく使う時間

# timePickerApply
source: Apply
ja: 適用

# selectionDialogApply
source: Apply
ja: 適用

# realTimePreviewTitle
source: MinQ Preview
ja: MinQ プレビュー

# realTimePreviewButton
source: Primary Button
ja: プライマリボタン

# realTimePreviewQuest
source: Sample Quest
ja: サンプルクエスト

# realTimePreviewQuestSubtitle
source: Continue daily habits
ja: 毎日の習慣を継続しよう

# realTimePreviewCompleted
source: Completed
ja: 完了

# realTimePreviewProgress
source: This week's progress
ja: 今週の進捗

# realTimePreviewLightMode
source: Light Mode Preview
ja: ライトモードプレビュー

# realTimePreviewDarkMode
source: Dark Mode Preview
ja: ダークモードプレビュー

# settingsConfirmTitle
source: Confirm
ja: 確認

# settingsConfirmDangerousAction
source: Execute {action}? This action cannot be undone.
ja: {action}を実行しますか？ この操作は取り消せません。

# settingsConfirmExecute
source: Execute
ja: 実行

source: Stop
ja: 停止

source: Pause
ar: إيقاف مؤقت
ja: 一時停止

source: Resume
ar: استئناف
ja: 再開

source: Reload
ja: 再読み込み

source: Send
ar: إرسال
ja: 送信

source: Submit
ar: إرسال
ja: 送信

source: Apply
ja: 適用

source: Confirm
ja: 確認

source: Discard
ja: 破棄

source: Enable
ar: تفعيل
ja: 有効にする

source: Disable
ja: 無効にする

source: Later
ar: لاحقاً
ja: 後で

source: Offline Mode
ar: وضع عدم الاتصال
ja: オフラインモード

# offlineModeBanner
source: Offline mode - some features are limited
ja: オフラインモード - 一部機能が制限されています

# offlineOperationNotAvailable
source: This operation is not available offline
ar: هذه العملية غير متاحة في وضع عدم الاتصال
ja: オフラインのため、この操作は実行できません

# noInternetConnection
source: An internet connection is required. Please connect to Wi-Fi or mobile data and try again.
ar: لا يوجد اتصال بالإنترنت. قد لا تعمل بعض الميزات بشكل صحيح. يرجى التحقق من الاتصال والمحاولة مرة أخرى.
ja: インターネット接続が必要です。Wi-Fiまたはモバイルデータに接続して再度お試しください。

source: Offline
ar: غير متصل
ja: オフライン

# readOnlyLabel
source: Read only
ja: 読み取り専用

# syncStatusSyncing
source: Syncing...
ja: 同期中...

# syncStatusSynced
source: Synced
ja: 同期完了

# syncStatusFailed
source: Sync failed
ja: 同期失敗

# syncStatusPending
source: Sync pending
ja: 同期待機中

# updateProfileSuccess
source: Profile updated successfully
ja: プロフィールを更新しました

# updateProfileFailed
source: Failed to update profile
ja: プロフィールの更新に失敗しました

# hintStreakAchievement
source: Amazing streak! Keep up the great habit.
ja: 素晴らしいストリーク！引き続き習慣を続けましょう。

source: Discard changes?
ja: 変更を破棄しますか？

source: Unsaved changes will be lost.
ja: 保存されていない変更は失われます。

# confirmDeleteTitle
source: Confirm Delete
ja: 削除の確認

# confirmDeleteMessage
source: This action cannot be undone. Are you sure you want to delete?
ja: この操作は取り消せません。本当に削除しますか？

# errorOccurred
source: An error occurred
ar: حدث خطأ
ja: エラーが発生しました

# errorGeneric
source: Something went wrong. Please try again later.
ja: エラーが発生しました。時間をおいて再度お試しください。

# serverConnectionFailed
source: Failed to connect to server
ar: فشل في الاتصال بالخادم
ja: サーバーへの接続に失敗しました

# notSignedIn
source: You are not signed in.
ja: サインインしていません。

source: Language Settings
ja: 言語設定
